# --------------------------------------
# ---- Set Methods p3----
# --------------------------------------
#
# issuperset(setB)
# issubset(setB)
# isdisjoint(setB)
# --------------------------------------

# يعني يا صحيح يا خطأ boolean لي غنقراو فهاد الدرس كترجع methods ال




# --------------------------------------
# issuperset(setB)

# اللولة set وبغيتي تعرف واش غاع العناصر لي فيها كاينينش فال set هادي كتستعملها لكانت عندك شي
# setA كاملين كاينين فال setB واش العناصر لي ف check بمعنى اخر كدير

a = {1, 2, 3, 4, 5}
b = {1, 2, 3}
c = {1, 2, 3, 4, 6}

print(a.issuperset(b)) # True => all of "b" element are in "a" set
print(a.issuperset(c)) # False

# --------------------------------------

print("#" * 40)


# --------------------------------------
# issubset(setB)

# issuperset() هادي العكس ديال اللولة
# setB الاصلية العناصر ديالها كاملين كاينين فال setA واش ال check حيت هادي كدير

d = {1, 2, 3, 4}
e = {1, 2, 3}

print(d.issubset(e)) # False
print(d.issubset({1, 2, 3, 4, 5, 6})) # True

# --------------------------------------

print("#" * 40)

# --------------------------------------
# isdisjoint(setB)

# منفصلين يعني مفيهمش عناصر كيتشابهو sets هادي كتشوف واش جوج


f = {1, 2, 3, 4}
g = {1, "a", "b", "c"}
h = {"a", "b", "c"}
print(f.isdisjoint(g)) # False
print(f.isdisjoint(h)) # True

# --------------------------------------






# اذا كخلاصة

# setA كاينين فال setB كتشوف واش العناصر كاملين ديال issuperset() ال
# setB الاصلية كاينين فال setA كتشوف واش العناصر كاملين ديال issubset() اما ال
# منفصلين يعني مكيتشابهوش sets كتشوف واش جوج isdisjoint() اما ال
