# ------------------------------------
# --- Arithmetic Operators ---
# ------------------------------------
#
# [+] Addition
# [-] Substraction
# [*] Multiplication
# [/] Division => return floating point num
# [%] Modulus
# [**] Exponent
# [//] Floor division
# ------------------------------------

# هادو مايحتاج ضيع فيهم الوقت حيت باينين
# js لي فال arithmetics حيت تقريبا بحالهم بحال ال

# floor division و الحاجة الزايدة لي هي division غار اختلاف بسيط لي كاين فال


# اي عدد عشري float فالبايثون دائما كترجع division / دبا ال
# يعني وخا القسمة غترجع ليك عدد صحيح هنا فالبايثون لا غترجع ليك عدد عشري
# باش تحول لعدد صحيح int() يعني خاص تخدم بال

print(10 / 2) # 5.0
print(int(10 / 2)) # 5.


# ف باينة floor division اما بالنسبة لل
# حيت هي فجميع الحالات القسمة غترجع ليك عدد صحيح وخا فالاصل خارج القسمة يكون عدد عشري

print(11 / 2) # 5.5
print(11 // 2) # 5
print(107 // 10) # 10