# ----------------------------------------------
# --- Debugging Code ---
# ----------------------------------------------
#
# ----------------------------------------------

# الفكرة ديال الدرس باينة وهي انه فاش كيكون عندك مشروع تقريبا كبير وفيه اسطر بزاااف
# صغير غادي يخربقك error ف لوقع


# editor وهوما دوك النقط الحمراء لي كيكونو جنب الاسطر فال breakpoint لهذا كنستعملو ال
# انه يجي تالعندها ويوقف باش تشوف واش المشكل من تما debugger هاد النقط كيعلمو ال
# يوقف عندها debugger كديرها فالسطر لي نتا شاك فيه غيكون منو المشكل لهذا كتخلي ال breakpoint ال


# allow breakpoints everywhere هو settings ولكن اول حاجة خاص ديرها وهي انك تفعل واحد الخيار فال

mylist = [1, 2, 3, 5, 6]

def functionOne():
    print("hello")

functionOne()


# run and debug ديجا vscode لي فال extension عن طريق ال debugging وصاف فلخر كتبدا ال
# debugging خاصين بال modules وكاينين